Repository: Adchsj/okKindred
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, fr

source: Share photos privately between your family and tag your family members
fi: Jaa valokuvia yksityisesti välillä perheen ja merkitä perheenjäsenet
fr: Partagez vos photos privées entre votre famille et marquer vos membres de la famille

source: Our Story
fi: Meidän tarinamme
fr: Notre histoire

source: Would you like to know the story of how and why we created this site?
fi: Haluatko tietää tarinan siitä, kuinka ja miksi olemme luoneet tämän sivuston?
fr: Voulez-vous connaître l'histoire de comment et pourquoi nous avons créé ce site?

source: View details
fi: Tarkemmat tiedot
fr: Voir les détails

source: Contact Us
fi: Ota meihin yhteyttä
fr: Contactez nous

source: If you have any questions, want to report a bug, ask for a feature or contribute to the source code.
fi: Jos sinulla on kysyttävää, haluat ilmoittaa bug, kysy ominaisuus tai edistää lähdekoodia.
fr: Si vous avez des questions, veulent signaler un bug, demander une fonctionnalité ou contribuer au code source.

source: Frequently Asked Questions
fi: Usein Kysytyt Kysymykset
fr: Questions fréquemment posées

source: How it started
fi: Miten se alkoi
fr: Comment ça a commencé

source: Hello. I'm Justin on the left. And I'm Adrian on the right.
fi: Hei. Olen Justin vasemmalla. Ja olen Adrian oikealla.
fr: Bonjour. Je suis Justin sur la gauche. Et je suis Adrian sur la droite.

source: This is a website to record our family tree and act a bit like a social network. You can maintain a profile on here and discover how far the tree reaches! As a person is added to the family tree, they receive an email so they may become a user and add more people to it. The site was inspired by our family gatherings and the difficulties of explaining how we are all related. Our family is now very diverse with many ethnicities and has spread around the globe. As the family grows and evolves, we wanted a way to document everyone and keep in touch.
fi: Tämä on sivusto tallentaa Sukupuussamme ja toimivat vähän kuin sosiaalinen verkosto. Voit ylläpitää profiilin täällä ja selvittää, miten pitkälle puu saavuttaa! Koska henkilö lisätään sukupuun, he saavat sähköpostitse, jotta he voivat tulla käyttäjälle ja lisää ihmisiä sitä. Sivusto innostui meidän perhejuhliin ja vaikeudet selittää, kuinka me kaikki liittyvät. Perheemme on nyt hyvin monipuolinen monien etnisten ryhmien ja on levinnyt ympäri maailmaa. Kun perhe kasvaa ja kehittyy, halusimme tavan dokumentoida kaikki ja pitää yhteyttä.
fr: Ceci est un site Web pour enregistrer notre arbre généalogique et agir un peu comme un réseau social. Vous pouvez maintenir un profil sur ce site et découvrir à quel point l'arbre atteint! En tant que personne est ajouté à l'arbre généalogique, ils reçoivent un e-mail afin qu'ils puissent devenir un utilisateur et ajouter d'autres personnes à lui. Le site a été inspiré par nos réunions de famille et les difficultés d'expliquer la façon dont nous sommes tous liés. Notre famille est maintenant très diversifié avec de nombreuses ethnies et est répandu dans le monde entier. Alors que la famille se développe et évolue, nous voulions un moyen de documenter tout le monde et rester en contact.

source: Contact us via email <a href="mailto:info@okkindred.com">info@okkindred.com</a>
fi: Ota yhteyttä sähköpostitse <a href="mailto:info@okkindred.com"> info@okkindred.com</a>
fr: Contactez-nous par email <a href="mailto:info@okkindred.com"> info@okkindred.com </a>

source: If you are in our family we want to hear from you and are welcome to visit and stay round any time. If you have a login to this site and are part of my family, you can get my telephone number and address from my profile!
fi: Jos olet meidän perheessä me haluamme kuulla sinusta ja ovat tervetulleita ja pysyä ympäri tahansa. Jos sinulla on kirjautuminen tähän sivustoon ja ovat osa perhettäni, saat minun puhelinnumero ja osoite minun profiili
fr: Si vous êtes dans notre famille, nous voulons entendre parler de vous et nous sommes invités à visiter et rester autour de tout temps. Si vous avez une connexion à ce site et faites partie de ma famille, vous pouvez obtenir mon numéro de téléphone et adresse de mon profil!

source: Alternatively, if you are looking for some help using the site, or even if you want us to help you set up your own similar site please drop us a line!
fi: Vaihtoehtoisesti, jos etsit apua käyttää sivustoa, tai vaikka haluat meidän auttaa perustaa oman samanlainen sivuston ota pudottaa meidät linja!
fr: Alternativement, si vous cherchez un peu d'aide en utilisant le site, ou même si vous voulez que nous vous aidons à mettre en place votre propre site similaire s'il vous plaît nous laisser tomber une ligne!

source: We're quite nice people and do like to talk to people interested in the sames things we are: Geek stuff, software, music and crazy pan global Chinese families...
fi: Olemme ihan mukavia ihmisiä ja eivät halua puhua ihmisille kiinnostunut sames me saamme: Geek tavaraa, ohjelmistoja, musiikkia ja hullu pan maailmanlaajuinen kiinalaisten perheiden ...
fr: Nous sommes tout à fait des gens sympas et aimons parler aux personnes intéressées par les sames choses que nous sommes: Geek stuff, logiciels, musique et pan fou familles chinoises mondiales ...

source: Can anyone see my family's information?
fi: Näkeekö kukaan perheeni tiedot?
fr: Quelqu'un peut-il voir l'information de ma famille?

source: No, only people within your family tree that you have invited can see the information you input. The information is also not searchable by outside users or search engines.
fi: Ei vain ihmiset sisällä sukupuun, että olet kutsunut näet tiedot syötät. Tiedot ei myöskään ole haettavissa ulkopuolisille käyttäjille tai hakukoneita.
fr: Non, seules les personnes au sein de votre arbre généalogique que vous avez invités peuvent voir les informations que vous entrez. L'information est également pas consultable par les utilisateurs à l'extérieur ou les moteurs de recherche.

source: Is my information secure?
fi: Onko tietoni turvassa?
fr: Est-ce que mes renseignements personnels?

source: We take security and privacy very seriously. We keep the details of our family on this site, and we would never do anything to jeopardise this data! Only your own family members that you invite to share your tree are able to see the information that you enter on the site. Furthermore, we do not sell, trade, or rent your personal identification information to others.
fi: Otamme turvallisuuden ja yksityisyyden hyvin vakavasti. Pidämme yksityiskohdat perheemme tällä sivustolla, ja emme koskaan tee mitään vaarantaa nämä tiedot! Vain oman perheen jäsenille, että kutsut jakaa puu näkevät tiedot, jotka annat sivustolla. Lisäksi emme myy, vaihda tai vuokraa henkilökohtaisia ​​tunnistetietoja muille.
fr: Nous prenons la sécurité et la vie privée très au sérieux. Nous gardons les détails de notre famille sur ce site, et nous ne ferions jamais rien pour compromettre ces données! Seuls vos propres membres de la famille que vous invitez à partager votre arbre sont en mesure de voir les informations que vous entrez sur le site. En outre, nous ne vendons pas, échanger ou louer vos informations d'identification personnelle à d'autres.

source: The site is hosted with <a href="https://www.pythonanywhere.com/?affiliate_id=00022aed">PythonAnywhere</a> who themselves take privacy very seriously. We also use <a href="https://aws.amazon.com/s3/">Amazon S3</a> to store any images that you upload. We do use third party <a href="https://en.wikipedia.org/wiki/Geocoding">geocoding</a> services (Google & Microsoft). This is to convert a location into a longitude and latitude so we can plot it on a map. However no other identifying pieces of information (e.g. name) are supplied with this location to these third parties. So for example we will send solely the term 'Hong Kong' to Google who will then give us a latitude and longitude so we can plot it on a map.
fi: Sivusto on isännöi <a href="https://www.pythonanywhere.com/?affiliate_id=00022aed"> PythonAnywhere </a> joka itse ottaa yksityisyyttä hyvin vakavasti. Käytämme myös <a href="https://aws.amazon.com/s3/"> Amazonin S3 </a> tallentaa kaikki kuvat, jotka lataat. Teemme käyttää kolmannen osapuolen <a href="https://en.wikipedia.org/wiki/Geocoding"> geocoding </a> palvelujen (Google & Microsoft). Tämä on muuntaa sijainti tulee pituus- ja leveysasteen, jotta voimme piirtää sen kartalla. Kuitenkin mitään muita tunnistetietoja paloja tiedot (esim. Nimi) syötetään tähän paikkaan näille kolmansille osapuolille. Niinpä esimerkiksi lähetämme ainoastaan termiä "Hong Kong" Google, joka sitten antaa meille leveys- ja pituusaste, jotta voimme piirtää sen kartalla.
fr: Le site est hébergé par <a href="https://www.pythonanywhere.com/?affiliate_id=00022aed"> PythonAnywhere </a> qui se prennent la politique de confidentialité très au sérieux. Nous utilisons également <a href="https://aws.amazon.com/s3/"> Amazon S3 </a> pour stocker toutes les images que vous téléchargez. Nous utilisons les services de tiers <a href="https://en.wikipedia.org/wiki/Geocoding">géocodage</a> (Google & Microsoft). Ceci est de convertir un emplacement en longitude et la latitude afin que nous puissions tracer sur une carte. Toutefois, aucun d'autres pièces d'identification de l'information (par exemple le nom) sont fournis avec cet endroit à ces tiers. Ainsi, par exemple, nous allons envoyer uniquement le terme «Hong Kong» à Google, qui sera ensuite nous donner une latitude et la longitude afin que nous puissions tracer sur une carte.

source: If you are concerned, the site is entirely open source, so you can take a copy of the source code (see below), have a look how your information is stored or even host your own version of this website. We will be more than happy to help you set it up.
fi: Jos olet huolestunut, sivusto on täysin avoimen lähdekoodin, joten voit ottaa kopion lähdekoodista (katso jäljempänä), on katsoa, ​​miten tiedot on tallennettu tai jopa isännöidä omaa version tällä sivustolla. Meillä on enemmän kuin mielellään auttaa asettaa sen.
fr: Si vous êtes concerné, le site est entièrement open source, de sorte que vous pouvez prendre une copie du code source (voir ci-dessous), regardez comment votre information est stockée ou même héberger votre propre version de ce site. Nous serons heureux de vous aider à mettre en place.

source: Can I see the source code?
fi: Voinko nähdä lähdekoodia?
fr: Puis-je voir le code source?

source: The source code is located at <a href="https://github.com/JustinWingChungHui/okKindred">Github.com</a>. What you see on okKindred.com is taken from the 'production' branch.
fi: Lähdekoodi sijaitsee <a href="https://github.com/JustinWingChungHui/okKindred"> Github.com </a>. Mitä näet okKindred.com otetaan "tuotantoon" haara.
fr: Le code source se trouve à l'adresse <a href="https://github.com/JustinWingChungHui/okKindred">Github.com</a>. Ce que vous voyez sur okKindred.com est tiré de la branche «production».

source: We've issued it with an <a href="https://en.wikipedia.org/wiki/MIT_License">MIT licence</a> which means you are free to use, copy and modify the code for your own purpose. The <a href="https://github.com/JustinWingChungHui/okKindred/blob/master/README.rst">README</a> contains a basic overview on how it works and step by step instructions to deploy your own instance.
fi: Olemme antanut sen jollain <a href="https://en.wikipedia.org/wiki/MIT_License"> MIT lisenssin </a> mikä tarkoittaa vapaasti käyttää, kopioida ja muokata koodia oman tarkoitukseen . <a Href="https://github.com/JustinWingChungHui/okKindred/blob/master/README.rst"> README </a> sisältää perustiedot yleiskuvan siitä, miten se toimii ja askel askeleelta ohjeet sijoittaa oman esimerkiksi .
fr: Nous avons publié avec un <a href="https://en.wikipedia.org/wiki/MIT_License"> MIT </a> de licence qui signifie que vous êtes libre d'utiliser, de copier et de modifier le code pour votre propre usage . Le <a href="https://github.com/JustinWingChungHui/okKindred/blob/master/README.rst"> README </a> contient une vue d'ensemble sur la façon dont il fonctionne et des instructions étape par étape pour déployer votre propre instance .

source: We welcome anyone who has any ideas or who wishes to contribute to this project and make it better! We especially need help with translation into other languages. Please <a href="mailto:info@okkindred.com?subject=Development" >get in touch</a> if you would like to contribute, or (even better) make a pull request on Github :)
fi: Olemme tyytyväisiä kuka tahansa ideoita tai joka haluaa osallistua tähän projektiin ja tehdä se paremmin! Olemme erityisen tarvitsevat apua kääntämistä muille kielille. Ole hyvä <a href="mailto:info@okkindred.com?subject=Development"> yhteyttä </a> jos haluat edistää, tai (vielä parempi) esittää pull pyynnön Github :)
fr: Nous nous félicitons de tous ceux qui ont des idées ou qui souhaite contribuer à ce projet et le rendre meilleur! Nous avons particulièrement besoin de l'aide avec la traduction dans d'autres langues. S'il vous plaît <a href="mailto:info@okkindred.com?subject=Development">entrer en contact</a> si vous souhaitez contribuer, ou (encore mieux) faire un pull request sur Github :)

source: What's in it for you if it's free?
fi: Mitä se sinulle, jos se on ilmainen?
fr: Qu'est-ce qu'il ya dedans pour vous s'il est gratuit?

source: We are software developers, and this is a project created in our spare time to expand our skillset and to add to our portfolio to show off to others. This was the best way to organise information on our own family, and we hope that new users will offer suggestions to improve the site or even contribute code.
fi: Olemme ohjelmistokehittäjiä, ja tämä on projekti luotu meidän vapaa-aikaa laajentaa skillset ja lisätä tuotevalikoimaamme keuliminen muille. Tämä oli paras tapa järjestää tietoa oman perheen, ja toivomme, että uudet käyttäjät tarjota ehdotuksia parantaa sivuston tai jopa edistää koodia.
fr: Nous sommes des développeurs de logiciels, et ceci est un projet créé dans notre temps libre pour étendre notre niveau de compétences et d'ajouter à notre portefeuille de montrer aux autres. Ce fut la meilleure façon d'organiser l'information sur notre propre famille, et nous espérons que les nouveaux utilisateurs offriront des suggestions pour améliorer le site ou même contribuer au code.

source: Can I manage multiple family trees?
fi: Voinko hallita useita perhe puita?
fr: Puis-je gérer plusieurs arbres généalogiques?

source: No you can't! At least not yet. We are aware that this is something people may want, and may put this feature in the future.
fi: Ei et voi! Ainakaan vielä. Olemme tietoisia siitä, että tämä on jotain ihmiset saattavat haluta, ja ne voivat ottaa tämän ominaisuuden tulevaisuudessa.
fr: Non, vous ne pouvez pas! Au moins pas encore. Nous sommes conscients que cela est quelque chose de gens voudront peut-être, et peut mettre cette fonction à l'avenir.

source: Is there an iOS/Android app?
fi: Onko iOS / Android-sovellus?
fr: Y at-il une application iOS / Android?

source: No there is not yet. However, you will find that the website formats very nicely on a mobile device. If you are using Chrome on a mobile, you can add a shortcut of the website to your desktop which makes it look like an app for those in your family who are less tech savvy!
fi: Ei ei ole. Mutta tulet huomaamaan, että sivusto muotoilee erittäin hienosti mobiililaitteella. Jos käytät Chromea mobiili, voit lisätä linkin sivuston työpöydällesi mikä saa sen näyttämään sovellus niille perheen, jotka ovat vähemmän teknologiaa hyödyntävän!
fr: Non il n'y a pas encore. Cependant, vous trouverez que le site Web formats très bien sur un appareil mobile. Si vous utilisez Chrome sur un mobile, vous pouvez ajouter un raccourci du site sur votre bureau qui le fait ressembler à une application pour ceux de votre famille qui sont moins technophiles!

source: How can I show more family members in the tree?
fi: Miten voin näyttää enemmän perheenjäseniä puussa?
fr: Comment puis-je montrer plus de membres de la famille dans l'arbre?

source: The standard view just shows the one level of relation. However, if you go to the eldest relative's profile, you can 'Show Descendents'. This will show all descendents with blood relations but not their partners.
fi: Standardi näkymä vain näyttää yhden tason suhteen. Kuitenkin, jos menet vanhin suhteellinen profiilia, voit "Show Descendents". Tämä näyttää kaikki jälkeläiset verta suhteita, mutta ei niiden kumppaneita.
fr: La vue standard affiche seulement le seul niveau de relation. Cependant, si vous allez au profil du parent le plus âgé, vous pouvez «Afficher Descendents». Cela montrera tous les descendants des relations de sang, mais pas leurs partenaires.

source: Displaying a family tree on a mobile device without it turning into a mess is a challenge that is yet to be resolved.
fi: Näyttäminen sukupuu mobiililaitteella ilman sitä kääntämällä sotkuun on haaste, joka on vielä ratkaistava.
fr: Affichage d'un arbre sur un appareil mobile sans qu'il se transforme en un désordre est un défi qui doit encore être résolu.

source: What browsers does this work on?
fi: Mitä selaimia tämä työ?
fr: Quels sont les navigateurs ce travail sur?

source: The site is tested on the latest version of the top browsers on desktop and mobile. There may be issues on unsupported browsers, such as older Android browsers, Internet Explorer 9 and below.
fi: Sivusto on testattu uusimman version alkuun selainten työpöydällä ja mobiili. Ongelma voi olla ei-tuetuissa selaimissa, kuten vanhemmat Android selaimilla, Internet Explorer 9 ja alla.
fr: Le site est testé sur la dernière version des meilleurs navigateurs sur ordinateur de bureau et mobile. Il peut y avoir des questions sur les navigateurs non pris en charge, tels que les anciens navigateurs Android, Internet Explorer 9 et ci-dessous.

source: Is this website available in Mainland China?
fi: Onko tämä sivusto käytettävissä Manner-Kiinassa?
fr: Est-ce site disponible en Chine continentale?

source: As far as we know it is, but availability of certain websites in China changes day to day. We have made some technical decisions to make it more likely to be available. For instance we use <a href="https://www.mapbox.com">Mapbox</a> for mapping instead of Google maps because the latter is blocked in China over a secure connection.
fi: Sikäli kuin tiedämme se on, mutta saatavuus tietyille verkkosivuille Kiinassa muuttuu päivittäin. Olemme tehneet joitakin teknisiä päätöksiä, jotta se olisi todennäköisesti saatavilla. Esimerkiksi käytämme <a href="https://www.mapbox.com"> Mapbox </a> kartoittamiseen sijaan Google Maps koska jälkimmäinen on estetty Kiinassa suojatun yhteyden kautta.
fr: Pour autant que nous savons qu'il est, mais la disponibilité de certains sites en Chine change de jour en jour. Nous avons pris des décisions techniques pour le rendre plus susceptibles d'être disponibles. Par exemple, nous utilisons <a href="https://www.mapbox.com"> MapBox </a> pour la cartographie au lieu de Google Maps parce que ce dernier est bloqué en Chine via une connexion sécurisée.

source: Is there a limit on images I can upload?
fi: Onko olemassa rajoitusta kuvia voin ladata?
fr: Y at-il une limite sur les images que je peux télécharger?

source: No at the moment there isn't. The images are stored on <a href="https://aws.amazon.com/s3/">Amazon S3</a> which is very very cheap so we don't mind footing the cost. However if a lot of users start to upload thousands and thousands of images, we will have to create a limit.
fi: Ei tällä hetkellä ei ole. Kuvat tallennetaan <a href="https://aws.amazon.com/s3/"> Amazon S3 </a> joka on erittäin hyvin halpaa, joten emme mielessä arvoisesti kustannuksia. Jos kuitenkin paljon käyttäjiä alkaa ladata tuhansia ja tuhansia kuvia, meidän on luotava raja.
fr: Pas pour le moment il n'y a pas. Les images sont stockées sur <a href="https://aws.amazon.com/s3/"> Amazon S3 </a> qui est très très pas cher, donc cela ne nous dérange pas pied d'égalité le coût. Toutefois, si un grand nombre d'utilisateurs commencent à télécharger des milliers et des milliers d'images, nous devrons créer une limite.

source: Can I advertise on your site?
fi: Voinko mainostaa sivustossasi?
fr: Puis-je annoncer sur votre site?

source: We have no plans to raise money via ads on the site mainly as we don't want to subject our Grandmas to any more advertising than they currently get.
fi: Meillä ei ole suunnitelmia nostaa rahaa kautta mainoksia sivuston lähinnä emme halua alistaa meidän Grandmas mitään enemmän mainontaa kuin he nykyisin saavat.
fr: Nous ne prévoyons pas de recueillir de l'argent via des annonces sur le site principalement comme nous ne voulons pas soumettre nos Grandmas à plus de publicité que ce qu'ils obtiennent actuellement.

source: I found a bug!
fi: Löysin virheen!
fr: J'ai trouvé un bug!

source: Please let us know! You can <a href="mailto:info@okkindred.com?Subject=I%%20found%%20a%%20bug!">email us</a> or you can add it to the <a href="https://github.com/JustinWingChungHui/okKindred/issues">issues list</a> on Github. If it's a security bug need to know ASAP so we can fix it!
fi: Kerro meille! Voit <a href="mailto:info@okkindred.com?Subject=I%%20found%%20a%%20bug!"> meille sähköpostia </a> tai voit lisätä sen <a href="https: //github.com/JustinWingChungHui/okKindred/issues">issues lista </a> Github. Jos se on turvallisuus bug täytyy tietää ASAP, jotta voimme korjata sen!
fr: S'il vous plaît laissez-nous savoir! Vous pouvez <a href="mailto:info@okkindred.com?Subject=I%%20found%%20a%%20bug!"> Envoyez-nous </a> ou vous pouvez l'ajouter à la <a href="https: liste des //github.com/JustinWingChungHui/okKindred/issues">issues </a> sur Github. Si elle est un bug de sécurité ont besoin de savoir le plus tôt possible afin que nous puissions résoudre le problème!

source: Can you add a feature so it can do xxxxx please?
fi: Voitteko lisätä ominaisuus, joten se voi tehdä xxxxx haluta?
fr: Pouvez-vous ajouter une fonctionnalité de sorte qu'il peut faire xxxxx s'il vous plaît?

source: Feel free to request new features via <a href="mailto:info@okkindred.com?Subject=Feature%%20Request">info@okkindred.com</a>. We will definitely consider them especially if it will benefit a lot of people (i.e. our family). This site is done in our spare time, so feature requests will be done when they're done.
fi: Voit vapaasti pyytää uusia ominaisuuksia kautta <a href="mailto:info@okkindred.com?Subject=Feature%%20Request"> info@okkindred.com </a>. Tulemme varmasti pitävät niitä varsinkin jos se hyödyttää paljon ihmisiä (eli meidän perhe). Tämä sivusto tehdään vapaa-ajalla, joten pyyntöjä tehdään, kun he ovat tehneet.
fr: Ne hésitez pas à demander de nouvelles fonctionnalités via <a href="mailto:info@okkindred.com?Subject=Feature%%20Request"> info@okkindred.com </a>. Nous allons certainement les considérer surtout si elle profitera à un grand nombre de personnes (à savoir notre famille). Ce site est fait dans notre temps libre, donc les demandes de fonctionnalités se fera quand ils sont fait.

source: Other genealogy websites look up local records to help create the tree, can you do the same?
fi: Muut sukututkimus sivustot etsiä paikallisia kirjaa auttaa luomaan puu, voit tehdä saman?
fr: D'autres sites de généalogie se tournent vers les dossiers locaux pour aider à créer l'arbre, pouvez-vous faire la même chose?
