Repository: Adchsj/okKindred
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, fr

source: We have no plans to implement this yet. The reason being is that most of our family originates from China. Because of the civil wars that occured in China in the 20th century and instability during the last decades of the Qing dynasty, few usable records exist that would be beneficial to us.
fi: Meillä ei ole suunnitelmia toteuttaa tämän vielä. Syy tähän on se, että suurin osa perheen peräisin Kiinasta. Koska sisällissodat joka tapahtui Kiinassa 1900-luvulla ja epävakautta viimeisten vuosikymmenien aikana Qing-dynastian, Muutama käyttökelpoinen kirjaa olemassa, jotka olisi hyödyllistä meille.
fr: Nous ne prévoyons pas de mettre en œuvre ce encore. La raison en est que la plupart de notre famille est originaire de Chine. En raison des guerres civiles qui ont eu lieu en Chine au 20ème siècle et d'instabilité au cours des dernières décennies de la dynastie Qing, quelques enregistrements utilisables existent qui serait bénéfique pour nous.

source: Given that many genealogy websites do this already, we would try to focus more on the social networking side of this project. However that is not to say that if in time a great need became apparent, we would not look at implementing such a feature.
fi: Koska monet sukututkimusta sivustot tehdä tämän jo, me yrittäisi keskittyä enemmän sosiaalisen verkottumisen puolella tämän projektin. Kuitenkin, että ei ole sanoa, että jos ajan suuri tarve kävi ilmeiseksi, emme olisi tarkastella toteuttaa tällainen ominaisuus.
fr: Étant donné que de nombreux sites Web de généalogie font déjà, nous allions essayer de se concentrer davantage sur le côté réseau social de ce projet. Cependant cela ne veut pas dire que si dans le temps un grand besoin est devenu évident, nous ne chercherions pas à mettre en œuvre une telle fonctionnalité.

source: For describing relationships you have 'Partnered' but not 'Married', you have 'Raised' but not 'Given Birth to'?
fi: Sillä kuvataan suhteita olet "Partneroitu" mutta ei "Naimisissa", olet "Raised" mutta ei "synnyttänyt '?
fr: Pour décrire les relations que vous avez «partenaire» mais pas «Marié», vous avez «Élevé» mais pas «donné naissance à»?

source: We've tried to keep the site as simple as possible and as inclusive as possible. The definitions of 'Raised', 'Raised by' and 'Partnered' give enough information to build a tree. They are inclusive of cross-cultural relationships which don't have a concept of marriage. They can include civil partnerships, common law partners, divorcees, adoptees and any other definitions that may or may not exist in different cultures.
fi: Olemme yrittäneet pitää sivuston mahdollisimman yksinkertainen ja mahdollisimman kattavat. Määritelmät "Raised", "Raised" ja "Partneroitu" antaa riittävästi tietoa rakentaa puuhun. Ne sisältävät kulttuurien suhteita, jotka eivät ole avioliittokäsite. Ne voivat sisältää parisuhteiden, common law kumppanit, eronneita, adoptoidut ja muita määritelmiä, jotka voidaan tai ei ole eri kulttuureissa.
fr: Nous avons essayé de garder le site aussi simple que possible et aussi inclusif que possible. Les définitions de «Élevé», «Élevé Par» et «Partenaire» donnent suffisamment d'informations pour construire un arbre. Ils comprennent des relations inter-culturelles qui ne disposent pas d'un concept de mariage. Ils peuvent inclure des partenariats civils, les conjoints de fait, les divorcées, les personnes adoptées et d'autres définitions qui peuvent ou peuvent ne pas exister dans différentes cultures.

source: Toggle navigation
fi: Toggle navigointi
fr: Changer la navigation

source: Map
fi: Kartta
fr: Carte

source: Gallery
fi: galleria
fr: Galerie

source: Search
fi: Hae
fr: Chercher

source: About
fi: Noin
fr: A Propos

source: Log Out
fi: Kirjautua ulos
fr: Déconnecter

source: Log In
fi: Kirjaudu sisään
fr: Connecter

source: Cookies are not enabled on your browser. Please enable cookies in your browser preferences to continue.
fi: Evästeet eivät ole käytössä selaimessasi. Salli evästeet asetuksissa jatkaa.
fr: Les cookies ne sont pas activés sur votre navigateur. S'il vous plaît activer cette option dans les préférences de votre navigateur pour continuer.

source: Invalid Email Confirmation
fi: Virheellinen Sähköpostivahvistuksen

source: Email
fi: Sähköposti

source: Occupation
fi: ammatti

source: Relation To Me
fi: Liittyy To Me

source: Photos
fi: Valokuvat

source: Contact
fi: Ottaa yhteyttä
