Repository: Adchsj/okKindred
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, fr

source: ok!Kindred Password Reset
fi: ok!Kindred Salasanan Nollaus
fr: Réinitialisation du mot de passe

source: Congratulations! Your password for ok!Kindred has just been updated.
fr: Félicitations! Votre mot de passe pour ok!Kindred vient d'être mis à jour.

source: You can now login using your new password at:
fr: Vous pouvez maintenant vous connecter en utilisant votre nouveau mot de passe à:

source: If you did not initiate this process, immediately contact us by replying to this email
fr: Si vous n'avez pas lancé ce processus, contactez-nous immédiatement en répondant àcet e-mail

source: You're receiving this email because you requested a password reset for your user account at ok!Kindred
fi: Saat tämän sähköpostiviestin, koska olet pyytänyt salasanan palauttamistakäyttäjätili ok!Kindred
fr: Vous recevez cet email car vous avez demandé une réinitialisation du mot de passe pour votrecompte utilisateur à ok!Kindred

source: Please go to the following page and choose a new password:
fi: Siirry seuraavaan sivulle ja valitse uusi salasana:
fr: Veuillez aller à la page suivante et choisir un nouveau mot de passe:

source: Password
fi: Salasana
fr: Mot de passe

source: Password confirmation
fi: salasanan vahvistus
fr: Confirmation mot de passe

source: Passwords don't match
fi: Salasanat eivät täsmää
fr: Les mots de passe ne correspondent pas

source: Your account has now been locked for 24 hours after 5 failed login attempts
fi: Tilisi on nyt lukittu 24 tunnin ajan 5 epäonnistuneet kirjautumisyrityksiä
fr: Votre compte a été bloqué pendant 24 heures après 5 tentatives de connexion infructueuses

source: If you need assistance, please email:
fi: Jos tarvitset apua, lähetä sähköpostia:
fr: Si vous avez besoin d'aide, s'il vous plaît envoyer un courriel:

source: Invalid Login
fi: Virheellinen kirjautuminen
fr: Identifiant invalide

source: Try Again
fi: Yritä uudelleen
fr: Réessayer

source: Logged In
fi: Kirjautunut sisään
fr: Connecté

source: Logged Out
fi: Kirjautunut ulos
fr: Déconnecté

source: Please sign in
fi: ole hyvä ja kirjaudu sisään
fr: S'il vous plaît vous connecter

source: Email Address
fi: Sähköpostiosoite
fr: Adresse e-mail

source: Email address
fi: Sähköpostiosoite
fr: Adresse e-mail

source: Sign In
fi: Kirjaudu sisään
fr: Se connecter

source: I forgot my password
fi: unohdin salasanani
fr: j'ai oublié mon mot de passe

source: Forgotten your password? Enter your email address below, and we'll email instructions for setting a new one.
fi: Unohditko salasanasi? Kirjoita sähköpostiosoitteesi alla, ja me sähköpostitse ohjeet asettamiseksi uuteen.
fr: Mot de passe oublié? Entrez votre adresse email ci-dessous et nous vous enverrons des instructions pour la mise en un nouveau.

source: Email Address:
fi: Sähköpostiosoite:
fr: Adresse e-mail:

source: Reset my password
fi: Nollaa salasana
fr: Réinitialiser mon mot de passe

source: Your password has been set. You may go ahead and log in now.
fi: Salasana on asetettu. Voit mennä eteenpäin ja kirjautua sisään nyt.
fr: Votre mot de passe a été défini. Vous pouvez aller de l'avant et vous connecter maintenant.

source: Log in
fi: Kirjaudu sisään
fr: S'identifier

source: Please enter your new password twice so we can verify you typed it in correctly.
fi: Anna uusi salasana kahdesti, jotta voimme tarkistaa olet kirjoittanut sen oikein.
fr: S'il vous plaît entrer votre nouveau mot de passe deux fois afin que nous puissions vérifier que vous tapé correctement.

source: New password:
fi: Uusi salasana:
fr: Nouveau mot de passe:

source: Confirm password:
fi: Vahvista salasana:
fr: Confirmez le mot de passe:

source: Change my password
fi: Vaihda salasana
fr: Changer mon mot de passe

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
fi: Salasananvaihtolinkkiä oli virheellinen, mahdollisesti koska se on jo käytetty. Pyydä uusi salasanan.
fr: Le lien de réinitialisation de mot était invalide, peut-être parce qu'il a déjà été utilisé. S'il vous plaît demander un nouveau mot de passe réinitialisé.

source: We've emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
fi: Olemme lähettänyt sinulle ohjeita asettamaan salasanaa, jos tili on olemassa kanssa sähköpostin syötit. Sinun pitäisi saada ne pian.
fr: Nous vous avons envoyé un e-instructions pour régler votre mot de passe, si un compte existe avec l'e-mail que vous avez entrée. Vous devriez les recevoir sous peu.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
fi: Jos et saa sähköpostia, varmista, että olet kirjoittanut osoitteen olet rekisteröitynyt, ja tarkista roskapostikansio.
fr: Si vous ne recevez pas de courriel, s'il vous plaît assurez-vous que vous avez entré l'adresse de votre inscription, et vérifiez votre dossier spam.

source: Settings
fi: asetukset
fr: Paramètres

source: Done
fi: Tehty
fr: Terminé

source: Options
fi: Vaihtoehdot
fr: options de

source: First Language
fi: Ensimmäinen kieli
fr: Première langue

source: Receive family update emails
fi: Perhe-päivitys sähköpostit
fr: Recevoir mises à jour des e-mails de la famille

source: Do you want to receive family update emails?
fi: Haluatko vastaanottaa perheeseen päivitys sähköpostit?
fr: Voulez-vous recevoir des mises à jour des e-mails de la famille?

source: Yes
fi: Joo
fr: Oui

source: No
fi: Ei
fr: Non

source: Receive update emails when you are identified in a photo
fi: Vastaanottaa päivitys sähköpostit, kun tunnistetaan valokuvaa
fr: Recevoir mises à jour des e-mails lorsque vous êtes identifié sur une photo

source: Do you want to receive update emails when you are identified in a photo?
fi: Haluatko vastaanottaa päivitystä sähköpostiviestit, kun tunnistetaan valokuvan?
fr: Voulez-vous recevoir des mises à jour des e-mails lorsque vous êtes identifié dans une photo?

source: Change Password
fi: Vaihda salasana
fr: Changer le mot de passe

source: New Password
fi: uusi salasana
fr: nouveau mot de passe

source: Minimum of 8 characters
fi: Vähintään 8 merkkiä
fr: Minimum de 8 caractères

source: Whoops, they must match!
fi: Oho, ne täytyy vastata!
fr: Whoops, ils doivent correspondre!

source: Confirm Password
fi: Vahvista salasana
fr: Confirmez le mot de passe

source: Update Password
fi: Päivitä Password
fr: Mise à jour Mot de passe

source: Goodbye and Farewell
fi: Näkemiin ja Farewell
fr: Au revoir et adieu

source: Leave ok!Kindred forever...
fi: Jätä ok! Kindred ikuisesti ...
fr: Laissez ok! Kindred pour toujours ...

source: Delete Profile
fi: Poista profiili
fr: Supprimer le profil

source: Are you sure you want to leave ok!Kindred? We would be very sad to see you leave!
fi: Oletko varma, että haluat lähteä ok! Kindred? Olisimme hyvin surullista nähdä lähdet!
fr: Etes-vous sûr de vouloir quitter ok! Kindred? Nous serions très triste de vous voir partir!

source: NO!!! I don't want to quit
fi: EI!!! En halua lopettaa
fr: NON!!! Je ne veux pas quitter

source: Yes but leave my profile
fi: Kyllä, mutta jättää profiilini
fr: Oui, mais laisser mon profil

source: Yes and delete my profile
fi: Kyllä ja poista profiili
fr: Oui et supprimer mon profil

source: Required field!
fi: Vaadittu kenttä!
fr: Champs requis!

source: Access denied
fi: Pääsy evätty
fr: Accès refusé

source: An invitation to ok!Kindred from {0}
fi: Kutsun ok! Kindred välillä {0}
fr: Une invitation à ok! Kindred de {0}

source: Hi {0} You have been invited by {1} to join ok!Kindred. ok!Kindred is a collaborative family tree and private social network for you and you family. A network has already been set up by one of your family members to help you keep in touch. To join, please go to {2}/accounts/confirmation={3}/
fi: Hei {0} Sinut on kutsunut {1} liittyä ok! Kindred. ok! Kindred on yhteistyöprojekti sukupuun ja yksityisen sosiaalinen verkosto sinulle ja perhe. Verkko on jo perustettu yksi perheen jäsenistä auttaa pitämään yhteyttä. Liittyä, mene {2}/accounts/confirmation={3}/
fr: Salut {0} Vous avez été invité par {1} à rejoindre ok! Kindred. ok! Kindred est un arbre de la famille collaboratif et réseau social privé pour vous et votre famille. Un réseau a déjà été mis en place par l'un des membres de votre famille pour vous aider à rester en contact. Pour vous inscrire, s'il vous plaît aller à {2}/accounts/confirmation={3}/

source: Welcome to ok!Kindred
fi: Tervetuloa ok! Kindred
fr: Bienvenue a ok! Kindred

source: Thank you for accepting the invitation from
fi: Kiitos hyväksyä kutsun
fr: Je vous remercie d'avoir accepté l'invitation de

source: to join ok!kindred, share your family tree and keep in contact with your family members!
fi: liittymään ok! suvulle jakaa sukupuun ja pitää yhteyttä oman perheen jäseniä!
fr: à rejoindre ok! proches, partager votre arbre généalogique et rester en contact avec les membres de votre famille!

source: Please create a new password:
fi: Luo uusi salasana:
fr: S'il vous plaît créer un nouveau mot de passe:

source: Join ok!Kindred
fr: Inscrivez-vous ok! Kindred

source: Unfortunately either your invite to join has expired, or is invalid. Please ask a member of your family to re-invite you.
fi: Valitettavasti joko kutsua liittymään on päättynyt tai on virheellinen. Ole hyvä kysyä perheenjäsen uudelleen kutsuvat.
fr: Malheureusement, soit votre invitation à se joindre a expiré ou est invalide. S'il vous plaît demander à un membre de votre famille de vous réinviter.

source: Hello
fi: Hei
fr: Bonjour

source: You have been invited by %(user_who_invited_person)s to join ok!Kindred: a collaborative family tree and private social network for you and your family. A network has already been set up by one of your family members to help you keep in touch.
fi: Sinut on kutsunut %(user_who_invited_person)s liittymään ok! Kindred: yhteistoiminnallista sukupuun ja yksityisen sosiaalinen verkosto sinulle ja perheellesi. Verkko on jo perustettu yksi perheen jäsenistä auttaa pitämään yhteyttä.
fr: Vous avez été invité par %(user_who_invited_person)s à rejoindre ok Kindred: un arbre de la famille collaboratif et réseau social privé pour vous et votre famille. Un réseau a déjà été mis en place par l'un des membres de votre famille pour vous aider à rester en contact.

source: If you would like to join, please click on the following link and choose a secure password that you will remember.
fi: Jos haluat liittyä, klikkaa seuraavaa linkkiä ja valitse turvallisen salasanan että muistat.
fr: Pour confirmer votre compte, s'il vous plaît cliquer sur le lien suivant et choisir un mot de passe sécurisé dont vous vous souviendrez.

source: Please, click the link and check it out. You can always leave if you wish. If you want to find out more, just go to <a href = "%(domain)s">%(domain)s</a> to find out more!
fi: Ole hyvä, klikkaa linkkiä ja tarkistaa sitä. Voit aina jättää, jos haluat. Jos haluat tietää enemmän, vain mennä <a href="%(domain)s">%(domain)s</a> tietää enemmän!
fr: S'il vous plaît, cliquez sur le lien pour decouvrir le website. Vous pouvez toujours le quitter si vous le souhaitez. Si vous voulez en savoir plus, rendez-vous à <a href="%(domain)s">%(domain)s</a> pour en savoir plus!

source: Thanks and lots of love from Justin & Adrian @ ok!Kindred
fi: Kiitos ja paljon rakkautta Justin & Adrian @ ok! Kindred
fr: Merci et beaucoup d'amour de Justin & Adrian @ ok! Kindred

source: ok!Kindred family update
fi: ok! Kindred perhe päivitys
fr: ok! Kindred mise à jour de la famille

source: One or more of your family has had details in ok!Kindred updated.
fi: Yksi tai useampi perhe on ollut yksityiskohtia ok! Suvulle päivitetty.
fr: Un ou plusieurs de votre famille a eu des détails dans ok! Kindred mise à jour.

source: The following people have been added to your family in ok!Kindred. Click on them to find out more:
fi: Seuraavat henkilöt on lisätty perheesi ok! Kindred. Klikkaa niitä Lisätietoja:
fr: Les personnes suivantes ont été ajoutées à votre famille ok! Kindred. Cliquez sur eux pour en savoir plus:

source: The following people's profiles have been updated. Click on them to find out more:
fi: Seuraavat ihmisten profiilit on päivitetty. Klikkaa niitä Lisätietoja:
fr: Les profils des personnes suivantes ont été mises à jour. Cliquez sur eux pour en savoir plus:

source: Female
fi: Nainen
fr: Femelle

source: Male
fi: Uros
fr: Mâle

source: Other
fi: muut
fr: Autre

source: Partnered
fi: yhteistyöhön
fr: Partenaire

source: Raised
fr: Elevé

source: Raised By
fi: Kasvatettu
fr: Élevé par

source: Cancel
fi: Peruuttaa
fr: Annuler

source: Existing Person
fi: Olemassa Person
fr: personne existant

source: New Person
fi: uusi henkilö
fr: Nouvelle personne

source: Name
fi: Nimi
fr: prénom

source: Gender
fi: sukupuoli
fr: Le genre

source: Location
fi: Sijainti
fr: Emplacement

source: Birth Year
fi: syntymävuosi
fr: Année de naissance

source: Required
fi: Edellytetään
fr: Champs obligatoires

source: Search Name
fi: haku Name
fr: Recherche Nom

source: Searching...
fi: Haetaan ...
fr: Recherche...

source: Save
fi: Tallentaa
fr: sauvegarder

source: Back
fi: Takaisin
fr: Arrière

source: Break Relations
fi: tauko Relations
fr: Relations pause

source: Break
fi: Tauko
fr: Pause

source: Add Relation
fi: Lisää suhde
fr: Ajouter des relations

source: Break Relation
fi: tauko suhde
fr: Pause Relation

source: Delete
fi: Poistaa
fr: Effacer

source: Click photo to upload new one
fi: Klikkaa kuva ladata uuden
fr: Cliquez sur la photo pour télécharger une nouvelle

source: Death Year (enter 0 if still alive)
fi: Kuolinvuosi (syötä 0, jos vielä elossa)
fr: Mort Année (entrez 0 si elle est encore en vie)

source: Death Year. Enter 0 if still alive.
fi: Death vuosi. Anna 0 jos vielä elossa.
fr: Mort Année. Entrez 0 si elle est encore en vie.

source: Spoken Languages
fi: Puhutut kielet
fr: Langues parlées

source: Tel Number
fr: Numéro de téléphone

source: Telephone/Mobile Number. Include the country code if your family is across several countries
fi: Puhelin / matkapuhelinnumero. Maakoodi jos perhe on useissa maissa
fr: Numéro de téléphone. Inclure le code du pays si votre famille est dans plusieurs pays

source: Location. Can be approximate e.g. Coventry, UK or 筲箕灣 香港
fi: Sijainti. Voi olla viitteellinen esim Coventry, Iso-Britannia tai 筲箕灣 香港
fr: Emplacement. Peut-être par exemple approximative Coventry, Royaume-Uni ou 筲箕灣 香港

source: Website
fi: Verkkosivusto
fr: Site Internet

source: Skype Name
fi: Skype nimi
fr: Nom Skype

source: Twitter
fi: Viserrys
fr: Gazouillement

source: Locked
fi: kiinni
fr: Fermé à clef

source: Lock your profile, so only you can edit it?
fi: Lukita profiilin, joten vain voit muokata sitä?
fr: Verrouillez votre profil, de sorte que vous pouvez le modifier?

source: Are you sure you want to delete profile?
fi: Oletko varma, että haluat poistaa profiilin?
fr: Etes-vous sûr de vouloir supprimer le profil?

source: NO!!!
fi: EI!!!
fr: NON!!!

source: Please trim the image to suit a profile picture:
fi: Siistisitkö kuvan sopivaksi profiilikuva:
fr: S'il vous plaît couper l'image en fonction d'une photo de profil:

source: New Profile Photo
fi: Uusi profiili Photo
fr: Nouveau Profil Photo

source: Upload the new profile photo for
fi: Ladata uuden profiilikuvaa
fr: Téléchargez la nouvelle photo de profil

source: Select file...
fi: Valitse tiedosto...
fr: Choisir le dossier...

source: Processing...
fr: En traitement...

source: Error uploading image
fi: Virhe ladattaessa kuva
fr: Erreur lors de l'envoi de l'image

source: No Match Found!
fi: Ei Match Found!
fr: Pas de résultat trouvé!

source: Tree
fi: Puu
fr: Arbre

source: Edit
fi: Muokata
fr: modifier

source: Ancestors
fi: Esivanhemmat
fr: Les ancêtres

source: Descendants
fi: jälkeläiset
fr: Descendance

source: This profile has been locked by this user.
fi: Tämä profiili on lukinnut tämän käyttäjän.
fr: Ce profil a été verrouillé par cet utilisateur.

source: No photo uploaded for
fi: Ei valokuvaa ladattu varten
fr: Aucune photo téléchargée pour

source: Invite to join
fi: Kutsu liittymään
fr: L'inviter à rejoindre

source: Death Year
fr: mort Année

source: Facebook Name
fr: Nom Facebook

source: Twitter Handle
fi: Twitter kahva
fr: Poignée Twitter

source: Linked In Profile
fr: Profil LinkedIn

source: Biography
fi: Elämäkerta
fr: la biographie

source: Edit Biography
fi: Edit Elämäkerta
fr: Modifier Biographie

source: A biography has not yet been written for this language.
fi: Elämäkerta ei ole vielä kirjoitettu tällä kielellä.
fr: Une biographie n'a pas encore été écrit pour cette langue.

source: Search Name:
fi: Haku Nimi:
fr: Recherche Nom:

source: raised
fi: esille
fr: élevé

source: partnered
fi: yhteistyöhön
fr: partenaire

source: Profile
fi: Profiili
fr: Profil

source: File is too big
fi: Tiedosto on liian suuri
fr: Le fichier est trop gros

source: Title
fi: otsikko
fr: Titre

source: Description
fi: Kuvaus
fr: La description

source: Loading...
fi: Ladataan...
fr: Chargement...

source: No more images to show
fi: Ei lisää kuvia näyttämään
fr: Pas plus d'images pour afficher

source: Error loading images
fi: Virhe ladattaessa kuvia
fr: images Erreur de chargement

source: Delete Gallery
fi: Poista Galleria
fr: Supprimer Galerie

source: Are you sure you want to leave delete this gallery? It will delete all the images in it!
fi: Oletko varma, että haluat lähteä poistaa tämän gallerian? Se poistaa kaikki kuvat siinä!
fr: Êtes-vous sûr de vouloir quitter Supprimer cette galerie? Il va supprimer toutes les images en elle!

source: Delete Gallery and all Pictures
fi: Poista Galleria ja kaikki kuvat
fr: Supprimer Galerie et toutes les photos

source: Details
fi: Yksityiskohdat
fr: Détails

source: Add New Gallery
fi: Lisää uusi Galleria
fr: Ajouter New Gallery

source: Galleries
fi: galleriat
fr: Galeries

source: No more galleries to show
fi: Ei enää gallerioita näyttää
fr: Pas plus de galeries pour afficher

source: Last Updated:
fi: Viimeksi päivitetty:
fr: Dernière mise à jour:

source: Click/Touch image to tag people
fi: Napsauta / Touch kuvaa koodata ihmisiä
fr: Cliquez / image Touchez pour marquer les gens

source: Required Field
fi: Vaadittu kenttä
fr: Champs requis

source: Date Taken
fr: Date prise

source: Make Gallery Thumbnail
fi: Tee Galleria Pikkukuva
fr: Faire Gallery Thumbnail

source: Search Address
fi: haku Osoite
fr: Recherche Adresse

source: OK
fi: kunnossa
fr: D'accord

source: Delete Image
fi: kuvan poistaminen
fr: Supprimer l'image

source: Are you sure you want to leave delete this image?
fi: Oletko varma, että haluat lähteä poistaa tämän kuvan?
fr: Êtes-vous sûr de vouloir quitter Supprimer cette image?

source: Tag Details
fi: Tag tiedot
fr: Tag Détails

source: Go To Profile
fi: Mene profiiliin
fr: Aller au profil

source: Delete Tag
fi: Poista Tag
fr: Supprimer Tag

source: Add a New Tag
fi: Lisää uusi tunniste
fr: Ajouter une nouvelle marque

source: Who is this?
fi: Kuka tämä on?
fr: Qui est-ce?

source: Pictures of
fi: kuvia
fr: Des images de

source: Upload New Photo
fi: Lataa Uusi Kuva
fr: Télécharger une nouvelle photo

source: Upload a new photo to the gallery
fi: Lataa uusi kuva galleriaan
fr: Ajouter une photo à la galerie

source: Select files...
fi: Valitse tiedostot ...
fr: Sélectionnez les fichiers...

source: You have been identified in a photo on ok!Kindred. Click on the following link to see it:
fi: Sinut on tunnistettu kuvaan ok! Kindred. Klikkaa seuraavaa linkkiä nähdä se:
fr: Vous avez été identifié dans une photo sur ok! Kindred. Cliquez sur le lien suivant pour voir:

source: You have been identified in a new photo in ok!Kindred
fi: Sinut on tunnistettu uusi kuva in ok! Kindred
fr: Vous avez été identifié dans une nouvelle photo en ok! Kindred

source: Hi {0} You have been identified in a photo. To see it, please go to {1}/gallery={2}/image={3}/
fi: Hei {0} Sinut on tunnistettu valokuvan. Nähdä se, mene {1}/gallery={2}/image={3}/
fr: Salut {0} Vous avez été identifié dans une photo. Pour le voir, s'il vous plaît aller à {1}/gallery={2}/image={3}/

source: English
fi: Englanti
fr: Anglais

source: Traditional Chinese
fi: Perinteinen kiina
fr: Chinois traditionnel

source: Simplified Chinese
fi: Yksinkertaistettu kiina
fr: Chinois simplifié

source: Polish
fi: Kiillottaa
fr: polonais

source: Finnish
fi: Suomalainen
fr: finlandais

source: French
fi: Ranskan kieli
fr: français

source: ok!Kindred sign up confirmation
fi: ok! kindred rekisteröityä vahvistus
fr: ok!Kindred confirmation d'inscription

source: Hi {0} To confirm your sign up, please go to {1}/accounts/sign_up_confirmation={2}/
fi: Hei {0} Vahvista allekirjoittaa, siirry {1}/accounts/sign_up_confirmation={2}/
fr: Salut {0} Pour confirmer votre inscription, s'il vous plaît aller à {1}/accounts/sign_up_confirmation={2}/

source: Thank you! %(new_signup.name)s Please check your email %(new_signup.email_address)s to confirm your account.
fi: Kiitos! %(new_signup.name)s Tarkista sähköpostisi %(new_signup.email_address)s vahvista tilisi.
fr: Je vous remercie! %(new_signup.name) s S'il vous plaît vérifier votre e-mail %(new_signup.email_address)s pour confirmer votre compte.

source: Account confirmation
fi: Tilin vahvistus
fr: Confirmation de compte

source: To confirm your account, please click on the following link and choose a secure password that you will remember.
fi: Vahvista tilisi, klikkaa seuraavaa linkkiä ja valitse turvallisen salasanan että muistat.
fr: Pour confirmer votre compte, s'il vous plaît cliquer sur le lien suivant et choisir un mot de passe sécurisé dont vous vous souviendrez.

source: The email is already in use!
fi: Sähköposti on jo käytössä!
fr: Le courriel est déjà utilisé!

source: Invalid email
fi: Virheellinen sähköpostiosoite
fr: Email invalide

source: To set up a new family network and join ok!Kindred, please provide the following information:
fi: Perustaa uuden perheen verkosto ja liittyä ok! Kindred, anna seuraavat tiedot:
fr: ! Pour mettre en place un nouveau réseau de famille et rejoindre ok Kindred, s'il vous plaît fournir les informations suivantes:

source: Join
fi: Liittyä seuraan
fr: Joindre

source: We are sorry. Unfortunately the page you are looking for has not been found.
fi: Olemme pahoillamme. Valitettavasti sivun etsit ei ole löydetty.
fr: Nous sommes désolés. Malheureusement, la page que vous recherchez n'a pas été trouvée.

source: Click here to return
fi: Täältä palata
fr: Cliquez ici pour revenir

source: We are sorry. But an error has occurred
fi: Olemme pahoillamme. Mutta on tapahtunut virhe
fr: Nous sommes désolés. Mais une erreur est survenue

source: The free and open source collaborative family tree and photo sharing website.
fi: Vapaan ja avoimen lähdekoodin yhteistyöhön sukupuu ja valokuvien jakamiseen verkkosivuilla.
fr: L'arbre généalogique et partage de photos site collaboratif source libre et ouvert.

source: Sign Up
fi: Kirjaudu
fr: S'inscrire

source: Create And Share
fi: Luoda ja jakaa
fr: Créer et partager

source: Create and share a multilingual family tree with your family and invite your family members to view it and add to it
fi: Luo ja jaa monikielinen sukupuu perheen kanssa ja kutsu perheenjäseniä nähdäksesi osoitteen ja liittää siihen
fr: Créer et partager un arbre généalogique multilingue avec votre famille et invitez vos membres de la famille pour le voir et y ajouter

source: Map your family
fi: Kartta perheesi
fr: Trace la carte de votre famille

source: Plot the locations of each of your relatives on a map
fi: Piirretään sijainnit kunkin sukulaisistasi kartalla
fr: Tracer les emplacements de chacun de vos proches sur une carte

source: Share Photos
fi: Jaa valokuvia
fr: Partager des photos
